[
    {
        "title": "Interview: GCC IPOs are shielded from global turbulence but may experience some delays- JPMorgan",
        "publication_date": "May 8, 2025",
        "author": "Bindu Rai",
        "full_text": "The pipeline for IPOs in the GCC will continue to move full steam ahead despite global market turbulence, which may only slightly delay them until the end of summer or post-summer, according to JPMorgan’s Managing Director and Co-Head of Equity Capital Markets, International for EMEA and APAC.\n“I don’t think that that fundamental has changed [with the volatility]. Obviously, we have lost some time because of what happened on April 2 with the US tariff announcement, and IPOs that were ready to go immediately have been forced to wait now,” Aloke Gupte told Zawya on the sidelines of the Capital Market Summit in Dubai.\nPerhaps the biggest push back in the region has been the Etihad Airways IPO in the UAE, a $1 billion listing that was reportedly postponed from a planned April offering. The aviation juggernaut, told Zawya last week, a decision to list will be eventually determined by its main shareholder, the Abu Dhabi sovereign-backed ADQ.\n“There will be a few [IPOs] which will now probably be delayed to either closer to the end of summer or post summer,” Gupte continued, not denying that an aviation related float from the GCC was possibly one such offering.\n“I think what we would like to say is that the pipeline, which was ready to go, has perhaps just shifted out a little bit. However, I fully expect the region to be a bright spot in the global framework, if perhaps a little bit muted compared to what we thought at the beginning of the year, just because of all the uncertainty and volatility that has kicked up in the last month.”\nAccording to Gupte, the investment bank fully expects to see robust IPO activity in 2025, despite market volatility stemming from a looming trade war, a weakening US dollar, and fluctuating oil prices.\n“I think globally, it felt that 2025 was going to be a bit of a build back year as far as IPOs were concerned, but not necessarily a massive issuance year, and part of that was because a number of large issuances already happened last year, while others were lining themselves up for 2026 and 2027 offering,” said Gupte.\nGCC is insulated\nOn Monday, Dubai Holding shared its plans to list a 12.5% stake in a residential real estate investment trust (REIT), amid a booming property sector that is looked upon as a global shock absorber. While several analysts called this $500 million offering a bold move by the emirate in the wake of economic turbulence, Gupte said this the right play by the emirate.\n“There’s a reason why the Dubai Holding IPO is the first $500 million offering globally since April 2, and that’s because the GCC is insulated from global shocks to a large extent,” he said. “If you look at the best performing big markets since the April 2 Liberation Day, Dubai is one of the three which are in the green.”\nYet, while GCC economies continue to be resilient to elevated macroeconomic risks, liquidity concerns remain in the face of a selective investor base prioritising stability over speculative growth.\nGupte said it was important to look at the bigger picture. “The best way to measure liquidity is look at your average daily trading volume against your free float market cap. For Dubai, that number is 0.13%, while Abu Dhabi is 0.15%. That suggests as the market deepens, liquidity will grow as well. However, you have to employ every tool in the toolkit to expand that liquidity in the market as well, and that will mean enabling rights issues, enabling secondary sell downs to happen in the form of programmes, bringing in equity linked and perhaps some derivative instruments in a slow format.”\nHe noted that the tech sector, along with healthcare, pharma, and real estate, will continue to set the stage for upcoming offerings. It is also crucial to get the local asset management industry more involved in capital markets in the region.\n“It’s essential, in a volatile world, to have a strong domestic investor base that is effectively a long-term holder of companies listed here. We’ve seen that in a number of markets. If you look at the last 12 months or so, the markets that have done well, which is the GCC as a whole, the UAE, India, and Japan, to some extent, all these markets had a very strong local asset management base,” Gupte said.\n“If you look at Europe in comparison, we saw fewer issuances because there are parts that don’t actually have much of a local asset management base that participates in IPOs and equity capital market transactions,” he added.\n(Reporting by Bindu Rai, editing by Seban Scaria)\nbindu.rai@lseg.com",
        "url": "https://www.zawya.com/en/capital-markets/equities/interview-gcc-ipos-are-shielded-from-global-turbulence-but-may-experience-some-delays-jp-morgan-myfdnxuq"
    }
]